Revit 2027 API
ParameterTypeId.FabricationPartDepthIn Property
 "Main Primary Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartDepthIn { get; }
Public Shared ReadOnly Property FabricationPartDepthIn As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartDepthIn {
	ForgeTypeId^ get ();
}
static member FabricationPartDepthIn : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace